Сравнитель/src/Catalogs/ОписанияТипов/ОписанияТипов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОписанияТипов</name>
  <attributes>
    <name>БазовыйТип</name>
    <type>
      <types>EnumRef.БазовыеТипыОписанийТипов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаЧисла</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТочностьЧисла</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеотрицательноеЧисло</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаСтроки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаНеограниченнойДлины</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСВременем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Сравнитель/src/Enums/БазовыеТипыОписанийТипов/БазовыеТипыОписанийТипов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>БазовыеТипыОписанийТипов</name>
  <enumValues>
    <name>Число</name>
  </enumValues>
  <enumValues>
    <name>Строка</name>
  </enumValues>
  <enumValues>
    <name>Дата</name>
  </enumValues>
  <enumValues>
    <name>Булево</name>
  </enumValues>
  <enumValues>
    <name>ХранилищеЗначения</name>
  </enumValues>
  <enumValues>
    <name>УникальныйИдентификатор</name>
  </enumValues>
</mdclass:Enum>

Сравнитель/src/Catalogs/ОписанияТипов/Forms/ФормаОписанияТипа/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Параметры.Ссылка) Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ОписанияТипов.ОписаниеПоСсылке(Параметры.Ссылка));
	КонецЕсли;
	
	ВернутьСсылку = Параметры.ВернутьСсылку;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьКвалификатор();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура БазовыйТипПриИзменении(Элемент)
	УстановитьКвалификатор();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Записать(Команда)
	ОписаниеТипа = ОписанияТиповКлиентСервер.НовоеОписаниеТипа();
	ЗаполнитьЗначенияСвойств(ОписаниеТипа, ЭтотОбъект);
	
	Если ВернутьСсылку Тогда
		Закрыть(ОписанияТиповВызовСервера.Ссылка(ОписаниеТипа));
	Иначе
		Закрыть(ОписаниеТипа);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьКвалификатор() Экспорт
	Если БазовыйТип = ПредопределенноеЗначение("Перечисление.БазовыеТипыОписанийТипов.Число") Тогда
		Элементы.Квалификаторы.ТекущаяСтраница = Элементы.КвалификаторЧисла;
	ИначеЕсли БазовыйТип = ПредопределенноеЗначение("Перечисление.БазовыеТипыОписанийТипов.Строка") Тогда
		Элементы.Квалификаторы.ТекущаяСтраница = Элементы.КвалификаторСтроки;
	ИначеЕсли БазовыйТип = ПредопределенноеЗначение("Перечисление.БазовыеТипыОписанийТипов.Дата") Тогда
		Элементы.Квалификаторы.ТекущаяСтраница = Элементы.КвалификаторДаты;
	Иначе
		Элементы.Квалификаторы.ТекущаяСтраница = Элементы.ПустойКвалификатор;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
